public/man/man1/git-commit.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - git-commit.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - git-commit.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>git-commit - Record changes to the repository</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<pre class="example">
git commit [-a | --interactive | --patch] [-s] [-v] [-u&lt;mode&gt;] [--amend]
           [--dry-run] [(-c | -C | --squash) &lt;commit&gt; | --fixup [(amend|reword):]&lt;commit&gt;]
           [-F &lt;file&gt; | -m &lt;msg&gt;] [--reset-author] [--allow-empty]
           [--allow-empty-message] [--no-verify] [-e] [--author=&lt;author&gt;]
           [--date=&lt;date&gt;] [--cleanup=&lt;mode&gt;] [--[no-]status]
           [-i | -o] [--pathspec-from-file=&lt;file&gt; [--pathspec-file-nul]]
           [(--trailer &lt;token&gt;[(=|:)&lt;value&gt;])...] [-S[&lt;keyid&gt;]]
           [--] [&lt;pathspec&gt;...]
</pre>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Create a new commit containing the current contents of the index and the
given log message describing the changes. The new commit is a direct
child of HEAD, usually the tip of the current branch, and the branch is
updated to point to it (unless no branch is associated with the working
tree, in which case HEAD is &#34;detached&#34; as described in
*git-checkout*(1)).</p>
<p>
The content to be committed can be specified in several ways:</p>
<blockquote>
<ol>
<li></li>
</ol>
<p>by using *git-add*(1) to incrementally &#34;add&#34; changes to the index before
using the <em>commit</em> command (Note: even modified files must be &#34;added&#34;);</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>by using *git-rm*(1) to remove files from the working tree and the
index, again before using the <em>commit</em> command;</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>by listing files as arguments to the <em>commit</em> command (without
–interactive or –patch switch), in which case the commit will ignore
changes staged in the index, and instead record the current content of
the listed files (which must already be known to Git);</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>by using the -a switch with the <em>commit</em> command to automatically &#34;add&#34;
changes from all known files (i.e. all files that are already listed in
the index) and to automatically &#34;rm&#34; files in the index that have been
removed from the working tree, and then perform the actual commit;</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>by using the –interactive or –patch switches with the <em>commit</em> command
to decide one by one which files or hunks should be part of the commit
in addition to contents in the index, before finalizing the operation.
See the “Interactive Mode” section of *git-add*(1) to learn how to
operate these modes.</p>
</blockquote>
<p>
The <strong>–dry-run</strong> option can be used to obtain a summary of what is
included by any of the above for the next commit by giving the same set
of parameters (options and paths).</p>
<p>
If you make a commit and then find a mistake immediately after that, you
can recover from it with <em>git reset</em>.</p>
</div>
</div>
