public/man/man1/git-commit.1/index.html
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>-a, –all</p>
<blockquote>
<p>Tell the command to automatically stage files that have been modified
and deleted, but new files you have not told Git about are not affected.</p>
</blockquote>
<p>
-p, –patch</p>
<blockquote>
<p>Use the interactive patch selection interface to choose which changes to
commit. See *git-add*(1) for details.</p>
</blockquote>
<p>
-C &lt;commit&gt;, –reuse-message=&lt;commit&gt;</p>
<blockquote>
<p>Take an existing commit object, and reuse the log message and the
authorship information (including the timestamp) when creating the
commit.</p>
</blockquote>
<p>
-c &lt;commit&gt;, –reedit-message=&lt;commit&gt;</p>
<blockquote>
<p>Like <em>-C</em>, but with <strong>-c</strong> the editor is invoked, so that the user can
further edit the commit message.</p>
</blockquote>
<p>
–fixup=[(amend|reword):]&lt;commit&gt;</p>
<blockquote>
<p>Create a new commit which &#34;fixes up&#34; <strong>&lt;commit&gt;</strong> when applied with <strong>git
rebase –autosquash</strong>. Plain <strong>–fixup=&lt;commit&gt;</strong> creates a &#34;fixup!&#34; commit
which changes the content of <strong>&lt;commit&gt;</strong> but leaves its log message
untouched. <strong>–fixup=amend:&lt;commit&gt;</strong> is similar but creates an &#34;amend!&#34;
commit which also replaces the log message of <strong>&lt;commit&gt;</strong> with the log
message of the &#34;amend!&#34; commit. <strong>–fixup=reword:&lt;commit&gt;</strong> creates an
&#34;amend!&#34; commit which replaces the log message of <strong>&lt;commit&gt;</strong> with its
own log message but makes no changes to the content of <strong>&lt;commit&gt;</strong>.</p>
<p>
The commit created by plain <strong>–fixup=&lt;commit&gt;</strong> has a subject composed of
&#34;fixup!&#34; followed by the subject line from &lt;commit&gt;, and is recognized
specially by <strong>git rebase –autosquash</strong>. The <strong>-m</strong> option may be used to
supplement the log message of the created commit, but the additional
commentary will be thrown away once the &#34;fixup!&#34; commit is squashed into
<strong>&lt;commit&gt;</strong> by <strong>git rebase –autosquash</strong>.</p>
<p>
The commit created by <strong>–fixup=amend:&lt;commit&gt;</strong> is similar but its
subject is instead prefixed with &#34;amend!&#34;. The log message of &lt;commit&gt;
is copied into the log message of the &#34;amend!&#34; commit and opened in an
editor so it can be refined. When <strong>git rebase –autosquash</strong> squashes the
&#34;amend!&#34; commit into <strong>&lt;commit&gt;</strong>, the log message of <strong>&lt;commit&gt;</strong> is
replaced by the refined log message from the &#34;amend!&#34; commit. It is an
error for the &#34;amend!&#34; commit&#39;s log message to be empty unless
<strong>–allow-empty-message</strong> is specified.</p>
<p>
<strong>–fixup=reword:&lt;commit&gt;</strong> is shorthand for <strong>–fixup=amend:&lt;commit&gt;
–only</strong>. It creates an &#34;amend!&#34; commit with only a log message (ignoring
any changes staged in the index). When squashed by <strong>git rebase
–autosquash</strong>, it replaces the log message of <strong>&lt;commit&gt;</strong> without making
any other changes.</p>
<p>
Neither &#34;fixup!&#34; nor &#34;amend!&#34; commits change authorship of <strong>&lt;commit&gt;</strong>
when applied by <strong>git rebase –autosquash</strong>. See *git-rebase*(1) for
details.</p>
</blockquote>
<p>
–squash=&lt;commit&gt;</p>
<blockquote>
<p>Construct a commit message for use with <strong>rebase –autosquash</strong>. The
commit message subject line is taken from the specified commit with a
prefix of &#34;squash! &#34;. Can be used with additional commit message options
(<strong>-m*/</strong>-c*/*-C*/*-F*). See *git-rebase*(1) for details.</p>
</blockquote>
<p>
–reset-author</p>
<blockquote>
<p>When used with -C/-c/–amend options, or when committing after a
conflicting cherry-pick, declare that the authorship of the resulting
commit now belongs to the committer. This also renews the author
timestamp.</p>
</blockquote>
<p>
–short</p>
<blockquote>
<p>When doing a dry-run, give the output in the short-format. See
<strong>git-status*(1) for details. Implies *–dry-run</strong>.</p>
</blockquote>
<p>
–branch</p>
<blockquote>
<p>Show the branch and tracking info even in short-format.</p>
</blockquote>
<p>
–porcelain</p>
<blockquote>
<p>When doing a dry-run, give the output in a porcelain-ready format. See
<strong>git-status*(1) for details. Implies *–dry-run</strong>.</p>
</blockquote>
<p>
–long</p>
<blockquote>
<p>When doing a dry-run, give the output in the long-format. Implies
<strong>–dry-run</strong>.</p>
</blockquote>
<p>
-z, –null</p>
<blockquote>
<p>When showing <strong>short</strong> or <strong>porcelain</strong> status output, print the filename
verbatim and terminate the entries with NUL, instead of LF. If no format
is given, implies the <strong>–porcelain</strong> output format. Without the <strong>-z</strong>
option, filenames with &#34;unusual&#34; characters are quoted as explained for
the configuration variable <strong>core.quotePath</strong> (see *git-config*(1)).</p>
</blockquote>
<p>
-F &lt;file&gt;, –file=&lt;file&gt;</p>
<blockquote>
<p>Take the commit message from the given file. Use <em>-</em> to read the message
from the standard input.</p>
</blockquote>
<p>
–author=&lt;author&gt;</p>
<blockquote>
<p>Override the commit author. Specify an explicit author using the
standard <strong>A U Thor &lt;author@example.com&gt;</strong> format. Otherwise &lt;author&gt; is
assumed to be a pattern and is used to search for an existing commit by
that author (i.e. rev-list –all -i –author=&lt;author&gt;); the commit
author is then copied from the first such commit found.</p>
</blockquote>
<p>
–date=&lt;date&gt;</p>
<blockquote>
<p>Override the author date used in the commit.</p>
</blockquote>
<p>
-m &lt;msg&gt;, –message=&lt;msg&gt;</p>
<blockquote>
<p>Use the given &lt;msg&gt; as the commit message. If multiple <strong>-m</strong> options are
given, their values are concatenated as separate paragraphs.</p>
<p>
The <strong>-m</strong> option is mutually exclusive with <strong>-c</strong>, <strong>-C</strong>, and <strong>-F</strong>.</p>
</blockquote>
<p>
-t &lt;file&gt;, –template=&lt;file&gt;</p>
<blockquote>
<p>When editing the commit message, start the editor with the contents in
the given file. The <strong>commit.template</strong> configuration variable is often
used to give this option implicitly to the command. This mechanism can
be used by projects that want to guide participants with some hints on
what to write in the message in what order. If the user exits the editor
without editing the message, the commit is aborted. This has no effect
when a message is given by other means, e.g. with the <strong>-m</strong> or <strong>-F</strong>
options.</p>
</blockquote>
<p>
-s, –signoff, –no-signoff</p>
<blockquote>
<p>Add a <strong>Signed-off-by</strong> trailer by the committer at the end of the commit
log message. The meaning of a signoff depends on the project to which
you&#39;re committing. For example, it may certify that the committer has
the rights to submit the work under the project&#39;s license or agrees to
some contributor representation, such as a Developer Certificate of
Origin. (See <strong><a href="https://developercertificate.org">https://developercertificate.org</a></strong> for the one used by the
Linux kernel and Git projects.) Consult the documentation or leadership
of the project to which you&#39;re contributing to understand how the
signoffs are used in that project.</p>
<p>
The –no-signoff option can be used to countermand an earlier –signoff
option on the command line.</p>
</blockquote>
<p>
–trailer &lt;token&gt;[(=|:)&lt;value&gt;]</p>
<blockquote>
<p>Specify a (&lt;token&gt;, &lt;value&gt;) pair that should be applied as a trailer.
(e.g. *git commit –trailer &#34;Signed-off-by:C O Mitter \
&lt;committer@example.com&gt;&#34; –trailer &#34;Helped-by:C O Mitter \
&lt;committer@example.com&gt;&#34;* will add the &#34;Signed-off-by&#34; trailer and the
&#34;Helped-by&#34; trailer to the commit message.) The <strong>trailer.*</strong>
configuration variables (*git-interpret-trailers*(1)) can be used to
define if a duplicated trailer is omitted, where in the run of trailers
each trailer would appear, and other details.</p>
</blockquote>
<p>
-n, –[no-]verify</p>
<blockquote>
<p>By default, the pre-commit and commit-msg hooks are run. When any of
<strong>–no-verify</strong> or <strong>-n</strong> is given, these are bypassed. See also
*githooks*(5).</p>
</blockquote>
<p>
–allow-empty</p>
<blockquote>
<p>Usually recording a commit that has the exact same tree as its sole
parent commit is a mistake, and the command prevents you from making
such a commit. This option bypasses the safety, and is primarily for use
by foreign SCM interface scripts.</p>
</blockquote>
<p>
–allow-empty-message</p>
<blockquote>
<p>Like –allow-empty this command is primarily for use by foreign SCM
interface scripts. It allows you to create a commit with an empty commit
message without using plumbing commands like *git-commit-tree*(1).</p>
</blockquote>
<p>
–cleanup=&lt;mode&gt;</p>
<blockquote>
<p>This option determines how the supplied commit message should be cleaned
up before committing. The <em>&lt;mode&gt;</em> can be <strong>strip</strong>, <strong>whitespace</strong>,
<strong>verbatim</strong>, <strong>scissors</strong> or <strong>default</strong>.</p>
<p>
strip</p>
<blockquote>
<p>Strip leading and trailing empty lines, trailing whitespace, commentary
and collapse consecutive empty lines.</p>
</blockquote>
<p>
whitespace</p>
<blockquote>
<p>Same as <strong>strip</strong> except #commentary is not removed.</p>
</blockquote>
<p>
verbatim</p>
<blockquote>
<p>Do not change the message at all.</p>
</blockquote>
<p>
scissors</p>
<blockquote>
<p>Same as <strong>whitespace</strong> except that everything from (and including) the
line found below is truncated, if the message is to be edited. &#34;<strong>#</strong>&#34; can
be customized with core.commentChar.</p>
<blockquote>
<pre class="example">
# ------------------------ &gt;8 ------------------------
</pre>
</blockquote>
</blockquote>
<p>
default</p>
<blockquote>
<p>Same as <strong>strip</strong> if the message is to be edited. Otherwise <strong>whitespace</strong>.</p>
</blockquote>
<p>
The default can be changed by the <strong>commit.cleanup</strong> configuration
variable (see *git-config*(1)).</p>
</blockquote>
<p>
-e, –edit</p>
<blockquote>
<p>The message taken from file with <strong>-F</strong>, command line with <strong>-m</strong>, and from
commit object with <strong>-C</strong> are usually used as the commit log message
unmodified. This option lets you further edit the message taken from
these sources.</p>
</blockquote>
<p>
–no-edit</p>
<blockquote>
<p>Use the selected commit message without launching an editor. For
example, <strong>git commit –amend –no-edit</strong> amends a commit without changing
its commit message.</p>
</blockquote>
<p>
–amend</p>
<blockquote>
<p>Replace the tip of the current branch by creating a new commit. The
recorded tree is prepared as usual (including the effect of the <strong>-i</strong> and
<strong>-o</strong> options and explicit pathspec), and the message from the original
commit is used as the starting point, instead of an empty message, when
no other message is specified from the command line via options such as
<strong>-m</strong>, <strong>-F</strong>, <strong>-c</strong>, etc. The new commit has the same parents and author as
the current one (the <strong>–reset-author</strong> option can countermand this).</p>
<p>
It is a rough equivalent for:</p>
<blockquote>
<pre class="example">
        $ git reset --soft HEAD^
        $ ... do something else to come up with the right tree ...
        $ git commit -c ORIG_HEAD
</pre>
</blockquote>
<p>
but can be used to amend a merge commit.</p>
<p>
You should understand the implications of rewriting history if you amend
a commit that has already been published. (See the &#34;RECOVERING FROM
UPSTREAM REBASE&#34; section in *git-rebase*(1).)</p>
</blockquote>
<p>
–no-post-rewrite</p>
<blockquote>
<p>Bypass the post-rewrite hook.</p>
</blockquote>
<p>
-i, –include</p>
<blockquote>
<p>Before making a commit out of staged contents so far, stage the contents
of paths given on the command line as well. This is usually not what you
want unless you are concluding a conflicted merge.</p>
</blockquote>
<p>
-o, –only</p>
<blockquote>
<p>Make a commit by taking the updated working tree contents of the paths
specified on the command line, disregarding any contents that have been
staged for other paths. This is the default mode of operation of <em>git
commit</em> if any paths are given on the command line, in which case this
option can be omitted. If this option is specified together with
<strong>–amend</strong>, then no paths need to be specified, which can be used to
amend the last commit without committing changes that have already been
staged. If used together with <strong>–allow-empty</strong> paths are also not
required, and an empty commit will be created.</p>
</blockquote>
<p>
–pathspec-from-file=&lt;file&gt;</p>
<blockquote>
<p>Pathspec is passed in <strong>&lt;file&gt;</strong> instead of commandline args. If <strong>&lt;file&gt;</strong>
is exactly <strong>-</strong> then standard input is used. Pathspec elements are
separated by LF or CR/LF. Pathspec elements can be quoted as explained
for the configuration variable <strong>core.quotePath</strong> (see <strong>git-config*(1)).
See also *–pathspec-file-nul</strong> and global <strong>–literal-pathspecs</strong>.</p>
</blockquote>
<p>
–pathspec-file-nul</p>
<blockquote>
<p>Only meaningful with <strong>–pathspec-from-file</strong>. Pathspec elements are
separated with NUL character and all other characters are taken
literally (including newlines and quotes).</p>
</blockquote>
<p>
-u[&lt;mode&gt;], –untracked-files[=&lt;mode&gt;]</p>
<blockquote>
<p>Show untracked files.</p>
<p>
The mode parameter is optional (defaults to <em>all</em>), and is used to
specify the handling of untracked files; when -u is not used, the
default is <em>normal</em>, i.e. show untracked files and directories.</p>
<p>
The possible options are:</p>
<blockquote>
<p>·</p>
<p>
<em>no</em> - Show no untracked files</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>normal</em> - Shows untracked files and directories</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<em>all</em> - Also shows individual files in untracked directories.</p>
</blockquote>
<p>
All usual spellings for Boolean value <strong>true</strong> are taken as <strong>normal</strong> and
<strong>false</strong> as <strong>no</strong>. The default can be changed using the
status.showUntrackedFiles configuration variable documented in
*git-config*(1).</p>
</blockquote>
<p>
-v, –verbose</p>
<blockquote>
<p>Show unified diff between the HEAD commit and what would be committed at
the bottom of the commit message template to help the user describe the
commit by reminding what changes the commit has. Note that this diff
output doesn&#39;t have its lines prefixed with <em>#</em>. This diff will not be a
part of the commit message. See the <strong>commit.verbose</strong> configuration
variable in *git-config*(1).</p>
<p>
If specified twice, show in addition the unified diff between what would
be committed and the worktree files, i.e. the unstaged changes to
tracked files.</p>
</blockquote>
<p>
-q, –quiet</p>
<blockquote>
<p>Suppress commit summary message.</p>
</blockquote>
<p>
–dry-run</p>
<blockquote>
<p>Do not create a commit, but show a list of paths that are to be
committed, paths with local changes that will be left uncommitted and
paths that are untracked.</p>
</blockquote>
<p>
–status</p>
<blockquote>
<p>Include the output of *git-status*(1) in the commit message template
when using an editor to prepare the commit message. Defaults to on, but
can be used to override configuration variable commit.status.</p>
</blockquote>
<p>
–no-status</p>
<blockquote>
<p>Do not include the output of *git-status*(1) in the commit message
template when using an editor to prepare the default commit message.</p>
</blockquote>
<p>
-S[&lt;keyid&gt;], –gpg-sign[=&lt;keyid&gt;], –no-gpg-sign</p>
<blockquote>
<p>GPG-sign commits. The <strong>keyid</strong> argument is optional and defaults to the
committer identity; if specified, it must be stuck to the option without
a space. <strong>–no-gpg-sign</strong> is useful to countermand both <strong>commit.gpgSign</strong>
configuration variable, and earlier <strong>–gpg-sign</strong>.</p>
</blockquote>
<p>
–</p>
<blockquote>
<p>Do not interpret any more arguments as options.</p>
</blockquote>
<p>
&lt;pathspec&gt;…</p>
<blockquote>
<p>When pathspec is given on the command line, commit the contents of the
files that match the pathspec without recording the changes already
added to the index. The contents of these files are also staged for the
next commit on top of what have been staged before.</p>
<p>
For more details, see the <em>pathspec</em> entry in *gitglossary*(7).</p>
</blockquote>
</div>
</div>
