content/man/man1/git-commit.1.org
* EXAMPLES
When recording your own work, the contents of modified files in your
working tree are temporarily stored to a staging area called the "index"
with /git add/. A file can be reverted back, only in the index but not
in the working tree, to that of the last commit with *git restore
--staged <file>*, which effectively reverts /git add/ and prevents the
changes to this file from participating in the next commit. After
building the state to be committed incrementally with these commands,
*git commit* (without any pathname parameter) is used to record what has
been staged so far. This is the most basic form of the command. An
example:

#+begin_quote
#+begin_example
$ edit hello.c
$ git rm goodbye.c
$ git add hello.c
$ git commit
#+end_example

#+end_quote

Instead of staging files after each individual change, you can tell *git
commit* to notice the changes to the files whose contents are tracked in
your working tree and do corresponding *git add* and *git rm* for you.
That is, this example does the same as the earlier example if there is
no other change in your working tree:

#+begin_quote
#+begin_example
$ edit hello.c
$ rm goodbye.c
$ git commit -a
#+end_example

#+end_quote

The command *git commit -a* first looks at your working tree, notices
that you have modified hello.c and removed goodbye.c, and performs
necessary *git add* and *git rm* for you.

After staging changes to many files, you can alter the order the changes
are recorded in, by giving pathnames to *git commit*. When pathnames are
given, the command makes a commit that only records the changes made to
the named paths:

#+begin_quote
#+begin_example
$ edit hello.c hello.h
$ git add hello.c hello.h
$ edit Makefile
$ git commit Makefile
#+end_example

#+end_quote

This makes a commit that records the modification to *Makefile*. The
changes staged for *hello.c* and *hello.h* are not included in the
resulting commit. However, their changes are not lost --- they are still
staged and merely held back. After the above sequence, if you do:

#+begin_quote
#+begin_example
$ git commit
#+end_example

#+end_quote

this second commit would record the changes to *hello.c* and *hello.h*
as expected.

After a merge (initiated by /git merge/ or /git pull/) stops because of
conflicts, cleanly merged paths are already staged to be committed for
you, and paths that conflicted are left in unmerged state. You would
have to first check which paths are conflicting with /git status/ and
after fixing them manually in your working tree, you would stage the
result as usual with /git add/:

#+begin_quote
#+begin_example
$ git status | grep unmerged
unmerged: hello.c
$ edit hello.c
$ git add hello.c
#+end_example

#+end_quote

After resolving conflicts and staging the result, *git ls-files -u*
would stop mentioning the conflicted path. When you are done, run *git
commit* to finally record the merge:

#+begin_quote
#+begin_example
$ git commit
#+end_example

#+end_quote

As with the case to record your own changes, you can use *-a* option to
save typing. One difference is that during a merge resolution, you
cannot use *git commit* with pathnames to alter the order the changes
are committed, because the merge should be recorded as a single commit.
In fact, the command refuses to run when given pathnames (but see *-i*
option).

* COMMIT INFORMATION
Author and committer information is taken from the following environment
variables, if set:

#+begin_quote
#+begin_example
GIT_AUTHOR_NAME
GIT_AUTHOR_EMAIL
GIT_AUTHOR_DATE
GIT_COMMITTER_NAME
GIT_COMMITTER_EMAIL
GIT_COMMITTER_DATE
#+end_example

#+end_quote

(nb "<", ">" and "\n"s are stripped)

The author and committer names are by convention some form of a personal
name (that is, the name by which other humans refer to you), although
Git does not enforce or require any particular form. Arbitrary Unicode
may be used, subject to the constraints listed above. This name has no
effect on authentication; for that, see the *credential.username*
variable in *git-config*(1).

In case (some of) these environment variables are not set, the
information is taken from the configuration items *user.name* and
*user.email*, or, if not present, the environment variable EMAIL, or, if
that is not set, system user name and the hostname used for outgoing
mail (taken from */etc/mailname* and falling back to the fully qualified
hostname when that file does not exist).

The *author.name* and *committer.name* and their corresponding email
options override *user.name* and *user.email* if set and are overridden
themselves by the environment variables.

The typical usage is to set just the *user.name* and *user.email*
variables; the other options are provided for more complex use cases.

* DATE FORMATS
The *GIT_AUTHOR_DATE* and *GIT_COMMITTER_DATE* environment variables
support the following date formats:

Git internal format

#+begin_quote
It is *<unix-timestamp> <time-zone-offset>*, where *<unix-timestamp>* is
the number of seconds since the UNIX epoch. *<time-zone-offset>* is a
positive or negative offset from UTC. For example CET (which is 1 hour
ahead of UTC) is *+0100*.

#+end_quote

RFC 2822

#+begin_quote
The standard date format as described by RFC 2822, for example *Thu, 07
Apr 2005 22:13:13 +0200*.

#+end_quote

ISO 8601

#+begin_quote
Time and date specified by the ISO 8601 standard, for example
*2005-04-07T22:13:13*. The parser accepts a space instead of the *T*
character as well. Fractional parts of a second will be ignored, for
example *2005-04-07T22:13:13.019* will be treated as
*2005-04-07T22:13:13*.

#+begin_quote
\\

*Note*

\\
In addition, the date part is accepted in the following formats:
*YYYY.MM.DD*, *MM/DD/YYYY* and *DD.MM.YYYY*.

#+end_quote

#+end_quote

In addition to recognizing all date formats above, the *--date* option
will also try to make sense of other, more human-centric date formats,
such as relative dates like "yesterday" or "last Friday at noon".

