public/man/man1/git-commit.1/index.html
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>When recording your own work, the contents of modified files in your
working tree are temporarily stored to a staging area called the &#34;index&#34;
with <em>git add</em>. A file can be reverted back, only in the index but not
in the working tree, to that of the last commit with <strong>git restore
–staged &lt;file&gt;</strong>, which effectively reverts <em>git add</em> and prevents the
changes to this file from participating in the next commit. After
building the state to be committed incrementally with these commands,
<strong>git commit</strong> (without any pathname parameter) is used to record what has
been staged so far. This is the most basic form of the command. An
example:</p>
<blockquote>
<pre class="example">
$ edit hello.c
$ git rm goodbye.c
$ git add hello.c
$ git commit
</pre>
</blockquote>
<p>
Instead of staging files after each individual change, you can tell <strong>git
commit</strong> to notice the changes to the files whose contents are tracked in
your working tree and do corresponding <strong>git add</strong> and <strong>git rm</strong> for you.
That is, this example does the same as the earlier example if there is
no other change in your working tree:</p>
<blockquote>
<pre class="example">
$ edit hello.c
$ rm goodbye.c
$ git commit -a
</pre>
</blockquote>
<p>
The command <strong>git commit -a</strong> first looks at your working tree, notices
that you have modified hello.c and removed goodbye.c, and performs
necessary <strong>git add</strong> and <strong>git rm</strong> for you.</p>
<p>
After staging changes to many files, you can alter the order the changes
are recorded in, by giving pathnames to <strong>git commit</strong>. When pathnames are
given, the command makes a commit that only records the changes made to
the named paths:</p>
<blockquote>
<pre class="example">
$ edit hello.c hello.h
$ git add hello.c hello.h
$ edit Makefile
$ git commit Makefile
</pre>
</blockquote>
<p>
This makes a commit that records the modification to <strong>Makefile</strong>. The
changes staged for <strong>hello.c</strong> and <strong>hello.h</strong> are not included in the
resulting commit. However, their changes are not lost — they are still
staged and merely held back. After the above sequence, if you do:</p>
<blockquote>
<pre class="example">
$ git commit
</pre>
</blockquote>
<p>
this second commit would record the changes to <strong>hello.c</strong> and <strong>hello.h</strong>
as expected.</p>
<p>
After a merge (initiated by <em>git merge</em> or <em>git pull</em>) stops because of
conflicts, cleanly merged paths are already staged to be committed for
you, and paths that conflicted are left in unmerged state. You would
have to first check which paths are conflicting with <em>git status</em> and
after fixing them manually in your working tree, you would stage the
result as usual with <em>git add</em>:</p>
<blockquote>
<pre class="example">
$ git status | grep unmerged
unmerged: hello.c
$ edit hello.c
$ git add hello.c
</pre>
</blockquote>
<p>
After resolving conflicts and staging the result, <strong>git ls-files -u</strong>
would stop mentioning the conflicted path. When you are done, run <strong>git
commit</strong> to finally record the merge:</p>
<blockquote>
<pre class="example">
$ git commit
</pre>
</blockquote>
<p>
As with the case to record your own changes, you can use <strong>-a</strong> option to
save typing. One difference is that during a merge resolution, you
cannot use <strong>git commit</strong> with pathnames to alter the order the changes
are committed, because the merge should be recorded as a single commit.
In fact, the command refuses to run when given pathnames (but see <strong>-i</strong>
option).</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
COMMIT INFORMATION
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>Author and committer information is taken from the following environment
variables, if set:</p>
<blockquote>
<pre class="example">
GIT_AUTHOR_NAME
GIT_AUTHOR_EMAIL
GIT_AUTHOR_DATE
GIT_COMMITTER_NAME
GIT_COMMITTER_EMAIL
GIT_COMMITTER_DATE
</pre>
</blockquote>
<p>
(nb &#34;&lt;&#34;, &#34;&gt;&#34; and &#34;\n&#34;s are stripped)</p>
<p>
The author and committer names are by convention some form of a personal
name (that is, the name by which other humans refer to you), although
Git does not enforce or require any particular form. Arbitrary Unicode
may be used, subject to the constraints listed above. This name has no
effect on authentication; for that, see the <strong>credential.username</strong>
variable in *git-config*(1).</p>
<p>
In case (some of) these environment variables are not set, the
information is taken from the configuration items <strong>user.name</strong> and
<strong>user.email</strong>, or, if not present, the environment variable EMAIL, or, if
that is not set, system user name and the hostname used for outgoing
mail (taken from <strong>/etc/mailname</strong> and falling back to the fully qualified
hostname when that file does not exist).</p>
<p>
The <strong>author.name</strong> and <strong>committer.name</strong> and their corresponding email
options override <strong>user.name</strong> and <strong>user.email</strong> if set and are overridden
themselves by the environment variables.</p>
<p>
The typical usage is to set just the <strong>user.name</strong> and <strong>user.email</strong>
variables; the other options are provided for more complex use cases.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
DATE FORMATS
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>The <strong>GIT_AUTHOR_DATE</strong> and <strong>GIT_COMMITTER_DATE</strong> environment variables
support the following date formats:</p>
<p>
Git internal format</p>
<blockquote>
<p>It is <strong>&lt;unix-timestamp&gt; &lt;time-zone-offset&gt;</strong>, where <strong>&lt;unix-timestamp&gt;</strong> is
the number of seconds since the UNIX epoch. <strong>&lt;time-zone-offset&gt;</strong> is a
positive or negative offset from UTC. For example CET (which is 1 hour
ahead of UTC) is <strong>+0100</strong>.</p>
</blockquote>
<p>
RFC 2822</p>
<blockquote>
<p>The standard date format as described by RFC 2822, for example <strong>Thu, 07
Apr 2005 22:13:13 +0200</strong>.</p>
</blockquote>
<p>
ISO 8601</p>
<blockquote>
<p>Time and date specified by the ISO 8601 standard, for example
<strong>2005-04-07T22:13:13</strong>. The parser accepts a space instead of the <strong>T</strong>
character as well. Fractional parts of a second will be ignored, for
example <strong>2005-04-07T22:13:13.019</strong> will be treated as
<strong>2005-04-07T22:13:13</strong>.</p>
<blockquote>
<p>\\</p>
<p>
<strong>Note</strong></p>
<p>
\\
In addition, the date part is accepted in the following formats:
<strong>YYYY.MM.DD</strong>, <strong>MM/DD/YYYY</strong> and <strong>DD.MM.YYYY</strong>.</p>
</blockquote>
</blockquote>
<p>
In addition to recognizing all date formats above, the <strong>–date</strong> option
will also try to make sense of other, more human-centric date formats,
such as relative dates like &#34;yesterday&#34; or &#34;last Friday at noon&#34;.</p>
</div>
</div>
