content/man/man1/git-commit.1.org
* DISCUSSION
Though not required, it's a good idea to begin the commit message with a
single short (no more than 50 characters) line summarizing the change,
followed by a blank line and then a more thorough description. The text
up to the first blank line in a commit message is treated as the commit
title, and that title is used throughout Git. For example,
*git-format-patch*(1) turns a commit into email, and it uses the title
on the Subject line and the rest of the commit in the body.

Git is to some extent character encoding agnostic.

#+begin_quote
·

The contents of the blob objects are uninterpreted sequences of bytes.
There is no encoding translation at the core level.

#+end_quote

#+begin_quote
·

Path names are encoded in UTF-8 normalization form C. This applies to
tree objects, the index file, ref names, as well as path names in
command line arguments, environment variables and config files
(*.git/config* (see *git-config*(1)), *gitignore*(5), *gitattributes*(5)
and *gitmodules*(5)).

Note that Git at the core level treats path names simply as sequences of
non-NUL bytes, there are no path name encoding conversions (except on
Mac and Windows). Therefore, using non-ASCII path names will mostly work
even on platforms and file systems that use legacy extended ASCII
encodings. However, repositories created on such systems will not work
properly on UTF-8-based systems (e.g. Linux, Mac, Windows) and vice
versa. Additionally, many Git-based tools simply assume path names to be
UTF-8 and will fail to display other encodings correctly.

#+end_quote

#+begin_quote
·

Commit log messages are typically encoded in UTF-8, but other extended
ASCII encodings are also supported. This includes ISO-8859-x, CP125x and
many others, but /not/ UTF-16/32, EBCDIC and CJK multi-byte encodings
(GBK, Shift-JIS, Big5, EUC-x, CP9xx etc.).

#+end_quote

Although we encourage that the commit log messages are encoded in UTF-8,
both the core and Git Porcelain are designed not to force UTF-8 on
projects. If all participants of a particular project find it more
convenient to use legacy encodings, Git does not forbid it. However,
there are a few things to keep in mind.

#+begin_quote
1.

/git commit/ and /git commit-tree/ issue a warning if the commit log
message given to it does not look like a valid UTF-8 string, unless you
explicitly say your project uses a legacy encoding. The way to say this
is to have *i18n.commitEncoding* in *.git/config* file, like this:

#+begin_quote
#+begin_example
[i18n]
        commitEncoding = ISO-8859-1
#+end_example

#+end_quote

Commit objects created with the above setting record the value of
*i18n.commitEncoding* in their *encoding* header. This is to help other
people who look at them later. Lack of this header implies that the
commit log message is encoded in UTF-8.

#+end_quote

#+begin_quote
2.

/git log/, /git show/, /git blame/ and friends look at the *encoding*
header of a commit object, and try to re-code the log message into UTF-8
unless otherwise specified. You can specify the desired output encoding
with *i18n.logOutputEncoding* in *.git/config* file, like this:

#+begin_quote
#+begin_example
[i18n]
        logOutputEncoding = ISO-8859-1
#+end_example

#+end_quote

If you do not have this configuration variable, the value of
*i18n.commitEncoding* is used instead.

#+end_quote

Note that we deliberately chose not to re-code the commit log message
when a commit is made to force UTF-8 at the commit object level, because
re-coding to UTF-8 is not necessarily a reversible operation.

* ENVIRONMENT AND CONFIGURATION VARIABLES
The editor used to edit the commit log message will be chosen from the
*GIT_EDITOR* environment variable, the core.editor configuration
variable, the *VISUAL* environment variable, or the *EDITOR* environment
variable (in that order). See *git-var*(1) for details.

Everything above this line in this section isn't included from the
*git-config*(1) documentation. The content that follows is the same as
what's found there:

commit.cleanup

#+begin_quote
This setting overrides the default of the *--cleanup* option in *git
commit*. See *git-commit*(1) for details. Changing the default can be
useful when you always want to keep lines that begin with the comment
character *#* in your log message, in which case you would do *git
config commit.cleanup whitespace* (note that you will have to remove the
help lines that begin with *#* in the commit log template yourself, if
you do this).

#+end_quote

commit.gpgSign

#+begin_quote
A boolean to specify whether all commits should be GPG signed. Use of
this option when doing operations such as rebase can result in a large
number of commits being signed. It may be convenient to use an agent to
avoid typing your GPG passphrase several times.

#+end_quote

commit.status

#+begin_quote
A boolean to enable/disable inclusion of status information in the
commit message template when using an editor to prepare the commit
message. Defaults to true.

#+end_quote

commit.template

#+begin_quote
Specify the pathname of a file to use as the template for new commit
messages.

#+end_quote

commit.verbose

#+begin_quote
A boolean or int to specify the level of verbosity with *git commit*.
See *git-commit*(1).

#+end_quote

* HOOKS
This command can run *commit-msg*, *prepare-commit-msg*, *pre-commit*,
*post-commit* and *post-rewrite* hooks. See *githooks*(5) for more
information.

* FILES
*$GIT_DIR/COMMIT_EDITMSG*

#+begin_quote
This file contains the commit message of a commit in progress. If *git
commit* exits due to an error before creating a commit, any commit
message that has been provided by the user (e.g., in an editor session)
will be available in this file, but will be overwritten by the next
invocation of *git commit*.

#+end_quote

* SEE ALSO
*git-add*(1), *git-rm*(1), *git-mv*(1), *git-merge*(1),
*git-commit-tree*(1)

* GIT
Part of the *git*(1) suite
