public/man/man1/git-commit.1/index.html
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
DISCUSSION
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>Though not required, it&#39;s a good idea to begin the commit message with a
single short (no more than 50 characters) line summarizing the change,
followed by a blank line and then a more thorough description. The text
up to the first blank line in a commit message is treated as the commit
title, and that title is used throughout Git. For example,
*git-format-patch*(1) turns a commit into email, and it uses the title
on the Subject line and the rest of the commit in the body.</p>
<p>
Git is to some extent character encoding agnostic.</p>
<blockquote>
<p>·</p>
<p>
The contents of the blob objects are uninterpreted sequences of bytes.
There is no encoding translation at the core level.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Path names are encoded in UTF-8 normalization form C. This applies to
tree objects, the index file, ref names, as well as path names in
command line arguments, environment variables and config files
(<strong>.git/config</strong> (see *git-config*(1)), *gitignore*(5), *gitattributes*(5)
and *gitmodules*(5)).</p>
<p>
Note that Git at the core level treats path names simply as sequences of
non-NUL bytes, there are no path name encoding conversions (except on
Mac and Windows). Therefore, using non-ASCII path names will mostly work
even on platforms and file systems that use legacy extended ASCII
encodings. However, repositories created on such systems will not work
properly on UTF-8-based systems (e.g. Linux, Mac, Windows) and vice
versa. Additionally, many Git-based tools simply assume path names to be
UTF-8 and will fail to display other encodings correctly.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Commit log messages are typically encoded in UTF-8, but other extended
ASCII encodings are also supported. This includes ISO-8859-x, CP125x and
many others, but <em>not</em> UTF-16/32, EBCDIC and CJK multi-byte encodings
(GBK, Shift-JIS, Big5, EUC-x, CP9xx etc.).</p>
</blockquote>
<p>
Although we encourage that the commit log messages are encoded in UTF-8,
both the core and Git Porcelain are designed not to force UTF-8 on
projects. If all participants of a particular project find it more
convenient to use legacy encodings, Git does not forbid it. However,
there are a few things to keep in mind.</p>
<blockquote>
<ol>
<li></li>
</ol>
<p><em>git commit</em> and <em>git commit-tree</em> issue a warning if the commit log
message given to it does not look like a valid UTF-8 string, unless you
explicitly say your project uses a legacy encoding. The way to say this
is to have <strong>i18n.commitEncoding</strong> in <strong>.git/config</strong> file, like this:</p>
<blockquote>
<pre class="example">
[i18n]
        commitEncoding = ISO-8859-1
</pre>
</blockquote>
<p>
Commit objects created with the above setting record the value of
<strong>i18n.commitEncoding</strong> in their <strong>encoding</strong> header. This is to help other
people who look at them later. Lack of this header implies that the
commit log message is encoded in UTF-8.</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p><em>git log</em>, <em>git show</em>, <em>git blame</em> and friends look at the <strong>encoding</strong>
header of a commit object, and try to re-code the log message into UTF-8
unless otherwise specified. You can specify the desired output encoding
with <strong>i18n.logOutputEncoding</strong> in <strong>.git/config</strong> file, like this:</p>
<blockquote>
<pre class="example">
[i18n]
        logOutputEncoding = ISO-8859-1
</pre>
</blockquote>
<p>
If you do not have this configuration variable, the value of
<strong>i18n.commitEncoding</strong> is used instead.</p>
</blockquote>
<p>
Note that we deliberately chose not to re-code the commit log message
when a commit is made to force UTF-8 at the commit object level, because
re-coding to UTF-8 is not necessarily a reversible operation.</p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
ENVIRONMENT AND CONFIGURATION VARIABLES
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>The editor used to edit the commit log message will be chosen from the
<strong>GIT_EDITOR</strong> environment variable, the core.editor configuration
variable, the <strong>VISUAL</strong> environment variable, or the <strong>EDITOR</strong> environment
variable (in that order). See *git-var*(1) for details.</p>
<p>
Everything above this line in this section isn&#39;t included from the
*git-config*(1) documentation. The content that follows is the same as
what&#39;s found there:</p>
<p>
commit.cleanup</p>
<blockquote>
<p>This setting overrides the default of the <strong>–cleanup</strong> option in <strong>git
commit</strong>. See *git-commit*(1) for details. Changing the default can be
useful when you always want to keep lines that begin with the comment
character <strong>#</strong> in your log message, in which case you would do <strong>git
config commit.cleanup whitespace</strong> (note that you will have to remove the
help lines that begin with <strong>#</strong> in the commit log template yourself, if
you do this).</p>
</blockquote>
<p>
commit.gpgSign</p>
<blockquote>
<p>A boolean to specify whether all commits should be GPG signed. Use of
this option when doing operations such as rebase can result in a large
number of commits being signed. It may be convenient to use an agent to
avoid typing your GPG passphrase several times.</p>
</blockquote>
<p>
commit.status</p>
<blockquote>
<p>A boolean to enable/disable inclusion of status information in the
commit message template when using an editor to prepare the commit
message. Defaults to true.</p>
</blockquote>
<p>
commit.template</p>
<blockquote>
<p>Specify the pathname of a file to use as the template for new commit
messages.</p>
</blockquote>
<p>
commit.verbose</p>
<blockquote>
<p>A boolean or int to specify the level of verbosity with <strong>git commit</strong>.
See *git-commit*(1).</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
HOOKS
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>This command can run <strong>commit-msg</strong>, <strong>prepare-commit-msg</strong>, <strong>pre-commit</strong>,
<strong>post-commit</strong> and <strong>post-rewrite</strong> hooks. See *githooks*(5) for more
information.</p>
</div>
</div>
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
FILES
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<p><strong>$GIT_DIR/COMMIT_EDITMSG</strong></p>
<blockquote>
<p>This file contains the commit message of a commit in progress. If <strong>git
commit</strong> exits due to an error before creating a commit, any commit
message that has been provided by the user (e.g., in an editor session)
will be available in this file, but will be overwritten by the next
invocation of <strong>git commit</strong>.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-12" class="outline-2">
<h2 id="headline-12">
SEE ALSO
</h2>
<div id="outline-text-headline-12" class="outline-text-2">
<p>*git-add*(1), *git-rm*(1), *git-mv*(1), *git-merge*(1),
*git-commit-tree*(1)</p>
</div>
</div>
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
GIT
</h2>
<div id="outline-text-headline-13" class="outline-text-2">
<p>Part of the *git*(1) suite</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
